---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteViewSpecElemsFromDiffViews
source: html/fbef5afa-056f-a92c-f57b-36c5a1244d9a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteViewSpecElemsFromDiffViews Property

Cannot paste view-specific elements from different views.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteViewSpecElemsFromDiffViews { get; }
```